
//Задача 20: Напишите программу, которая
// принимает на вход координаты двух точек и
// находит расстояние между ними в 2D
// пространстве.
// A (3,6); B (2,1) -> 5,09
// A (7,-5); B (1,-1) -> 7,21

double num = 3.09987565; // 3.09
double numRound = Math.Round(num, 2, MidpointRounding.ToZero);
System.Console.WriteLine(numRound);